/*
في المثال التالي:

انشئنا كلاس اسمه GK
يملك متغيرين وهما 
x و y
وبعدها عرفنا ثنين كونستركتر للكلاس وبعدها عرفنا دالة صديقة للكلاس وكتبنا الكود حقها خارج الكلاس
ووظيفة هذه الدالة انها تجمع قيمة 
x و y 
*/
#include <iostream>
using namespace std;


// هنا عرفنا الكلاس
class GK
{
private:
    int x, y;
public:
    // هنا عرفنا الكونستركتر 
    GK(){}
    GK(int x, int y)
    {
        this->x = x;
        this->y = y;
    }
    
    // هنا عرفنا رأس الدالة بداخل الكلاس ومحتواها نكتبه خارج الكلاس
    // هنا جعلنا الدالة هذه صديقة لهذا الكلاس وتستطيع الوصول للكلاس وخصائصه
    friend int Sum(GK);
};


// GK هنا كتبنا محتوى الدالة والتي جعلناها صديقة للكلاس
// GK جعلنا الدالة تأخذ بارميتر نوعه 
// لكي تجمع بين الخصائص التي يملك الكلاس وبعدها نرجع القيمة
int Sum(GK C1) 
{
    return C1.x + C1.y;
}



int main()
{
    // هنا انشئنا كائن من الكلاس
    GK C1(45 ,15);
    
    //هنا طبعنا نص بعدها استدعينا الدالة لكي ترجع القيمة بعد جمع قيمهم
    cout << "x + y = " << Sum(C1) << "\n\n";

return 0;
}