/*
في المثال التالي:
انشئنا كلاسين  وهما
A و B

بعدها عرفنا دالة في الكلاس B
تطبع معلومات الكلاس A

و جعلنا الكلاس B
صديق للكلاس A
يعني الكلاس B
يصل الى الكلاس A
والعكس غير صحيح      
*/
#include <iostream>
using namespace std;


// هنا عرفنا الكلاس الاول وهو A
class A
{
private:
    int x, y;
public:
    // هنا عرفنا الكونستركتر
    A(int x, int y)
    {
        this->x = x;
        this->y = y;
    }

    // هنا جعلنا الكلاس B
    // صديق للكلاس A
    friend class B;
};


// هنا عرفنا الكلاس الثاني وهو B
class B
{
public:
    // هنا عرفنا دالة تصل للكلاس الاول وتطبع معلوماته
    void gprint(A a)
    {
      cout << a.x << " + " << a.y << " = " << (a.x + a.y) << "\n\n";
    }
};



int main()
{
    A C1(15,15);    // انشئنا كائن من الكلاس الاول
    B C2;           // انشئنا كائن من الكلاس الثاني

    C2.gprint(C1); // استدعينا الدالة الموجودة في الكائن من الكلاس الثاني لكي تطبع معلومات الكائن من الكلاس الاول

return 0;
}