/*
هنا نفس المثال السابق ولاكن اردنا ان ترى الاخطاء عندما نريد ان نرث من كلاس نوعه final
او نغير محتوى دالة نوعها final

** فقط لكي تضح لك الصورة **
*/
#include <iostream>
using namespace std;

// هنا جعلنا الكلاس نوعه final
// وسوف نجعل كلاس اخر يرث منه وسوف يظهر خطا
class A final
{
public:
    void gprint()
    {
        cout << "From Class: A \n";
    }
};



/**
 * هنا عرفنا كلاس اسمه B
 * جعلنا هذا الكلاس يرث من الكلاس A
 * الذي في الاعلى والذي وضعنا له انه final
 * وسوف يظهر خطا
 * 
 * وبعدها عرفنا دالة بداخله نوعها final
 */
class B: public A
{
public:
    // هنا عرفنا الدالة التي لا يمكن تغير محتواها
    virtual void gprint() final
    {
        cout << "From Class: B \n";
    }
};



/**
 * هنا عرفنا كلاس اسمه C
 * يرث من الكلاس B
 * وحاولنا تغير محتوى الدالة التي ورثها وظهر لدينا خطأ
 */
class C: public B
{
public:
    // هنا حاولنا تغير محتوى الدالة التي ورثناها ولاكن ظهر خطا لان نوعها final
    void gprint()
    {
        cout << "From Class: C \n";
    }
};



int main()
{
    // هنا انشئنا كائن من كل كلاس وحاولنا ان نستدعي الدوال التي بداخلها
    A C1;
    C1.gprint();

    B C2;
    C2.gprint();

    C C3;
    C3.gprint();


return 0;
}