/*
Constructor:
هو عبارة عن دالة, يتم إستدعائها أثناء إنشاء كائن من الكلاس لإعطاء قيم أولية للخصائص الموجودة فيه.

أيّ كلاس تقوم بتعريفه, يملك كونستركتور إفتراضي حتى لو تقم بتعريفه له بنفسك و سبب ذلك أنه لا يمكن إنشاء كائن من كلاس إلا من خلال كونستركتور هذا الكلاس.
لهذا إن لم تقم بتعريف كونستركتور للكلاس بنفسك, فسوف يقوم مترجم لغة C++ 
بإنشاء كونستركتور إفتراضي فارغ بدلاً عنك عندما تحاول إنشاء كائن من الكلاس
*/


/*
في المثال التالي:
قمنا بأنشاء كلاس اسمه Car
يملك خاصيتين وهما
name | year الاسم والسنة
وبعدها انشئنا كونستركتور لكي يعطي قيم اولية لهذه الخاصيتين
بعدها انشئنا دالة تقوم بطباعة الخواص بشكل مرتب
*/
#include <iostream>
using namespace std;

// هن انشئنا كائن من الكلاس
class Car
{
private:
    string name;
    int year;
public:

    // هنا انشئنا كونستركتور يأخذ 2 بارميتير 
    Car(string name, int year) 
    {
        this->name = name;
        this->year = year;
    }

    //دالة لكي تطبع المعلومات
    void gprint()
    {
    cout << "Name: " << name;
    cout << "\nYear: " << year << "\n\n";        
    }
};




int main()
{
    string y = "Kia";
    int x = 2022;


    Car GK(y, x);            // create object | انشاء كائن واعطائه البيانات من خلال متغيرات في البرنامج
    Car GK2("toyota", 2021); // create object | انشاء كائن وعطائه بيانات من نفسك
    
    //طباعة معلومات الكائن
    GK.gprint();
    GK2.gprint();
return 0;
}