/*
في المثال التالي انشئنا Struct
بسيط يملك بعض الاشياء المهمة للانسان وهي:
الاسم | العمر | مكان ولادته
بعدها انشئنا دالة تطبع معلومات الشخص وانشئنا كائن من هذا struct 
بعدة طرق مختلفة لكي تستخدم الطريقة التي تعجبك او المناسبة لك
*/
#include <iostream>
using namespace std;

// هنا انشئنا Struct
struct Person
{
    string name;
    int age;
    string born;

    void get_info() //هذه الدالة تطبع بيانات الشخص من خلال الكائن الذي نستدعيه بها 
    {
        cout << "name = " << name << "\n";
        cout << "age = "  << age  << "\n";
        cout << "born = " << born << "\n";
    }
}C3; // 1
// انشاء كائن الطريقة الاولى 
// وذي طريقة لكي تنشئ كائن بشكل مباشر تستطيع ان تنشئ اكثر من واحد من خلال انك تضع فاصلة وتكتب اسم الكائن الاخر مثل السطر التالي:
// c3 ,c4 ,c5 etc..



int main()
{
    // اعطاء قيم للكائن الذي انشئناه بالطريقة الاولى
    C3 = {"Mohammed", 26, "Dammam"}; // هنا الكائن الذي انشئناه مباشرة بعد كتابة ال struct وهنا اعطيناه معلومات 
    C3.get_info(); //طباعة معلوماته 


    // 2
    Person C1; // انشاء كائن الطريقة الثانية 
    C1.name = "GK";
    C1.age = 22;
    C1.born = "Riyadh";
    C1.get_info(); //طباعة معلوماته 
    
    // 3
    //طريقة اخرى لانشاء Structure واعطائه قيم في نفس الوقت
    Person C2 = {"Ali", 25, "Abha"};
    C2.get_info(); //طباعة معلوماته
    
return 0;
}