/*
تعريف مؤشر كثابت:
إذا كنت تملك متغير ثابت يمكنك إنشاء مؤشر له و لكن عندها يجب أن تنشئ المؤشر كثابت أيضاً مما يجعلك غير قادر على جعله يشير لمتغير اخر
*/


/*
في المثال التالي قمنا بتعريف متغير ثابت إسمه x
قيمته 10
و مؤشر ثابت إسمه Pointer 
يشير للمتغير الثابت
*/
#include <iostream>
using namespace std;

int main()
{
    // هنا عرفنا متغير ثابت
    const int x = 10;
    
    // هنا عرفنا مؤشر ثابت يؤشر على المتغير الثابت 
    const int* Pointer = &x;
    
    // هنا طبعنا قيمة المتغير x
    // من خلال المؤشر
    cout << "Pointer = " << *Pointer << endl;
    
    return 0;
}