/*
في المثال التالي قمنا بتعريف متغيرين اسمهما
x و y
واعطيناهما قيم
بعدها قمنا بأنشاء مؤشر ثابت وجعلناه يؤشر على المتغير x
وبعدها جعلناه يؤشر على المتغير الاخر وهنا حدثت مشكلة لان المؤشر ثابت ويؤشر على شي واحد فقط
*/
#include <iostream>
using namespace std;

int main()
{
    // هنا قمنا بتعريف المتغيرين
    int x = 50;
    int y = 55;
    
    // هنا انشئنا المؤشر وجعلناه يؤشر على متغير
    int* const Pointer = &y;
    
    // هنا حاولنا تغير ما يؤشر عليه المؤشر وحصلت مشكلة
    Pointer = &x;
    
    return 0;
}