/*
مثال حول تعريف دوال لها نفس الإسم و تختلف في نوع الباراميترات:

في المثال التالي قمنا بتعريف دالتين إسمهما Plus
و نوعهما void
و لكنهما مختلفتان عن بعضهما بأنواع الباراميترات.

الدالة الأولى مهمتها جمع أي عددين نوعهما int
نمررهما لها عند استدعاءها و من ثم طباعة الناتج.

الدالة الثانية مهمتها جمع أي عددين نوعهما float
نمررهما لها عند استدعاءها و من ثم طباعة الناتج.
*/
#include <iostream>
using namespace std;

// int لجمع عددين نوعهما Plus هنا قمنا بتعريف دالة إسمها
void Plus(int A, int B)
{
    cout << A << " + " << B << " = " << (A + B) << endl;
}

// double لجمع عددين نوعهما Plus هنا قمنا بتعريف دالة إسمها
void Plus(double A, double B)
{
    cout << A << " + " << B << " = " << (A + B) << endl;
}



int main()
{
    Plus(55, 5);       // int هنا المترجم سيتم إستدعاء الدالة التي تأخذ باراميتر نوعه
    Plus(99.5, 0.5);   // double هنا المترجم سيتم إستدعاء الدالة التي تأخذ باراميتر نوعه
return 0;
}