/*
عندما تريد انشاء كائنات بنفس الاسم ولاكن تختلف عن بعضها البعض (يعني مثل المصفوفات 
array
وتفرق بين الكائنات من خلال الرقم مثل المصفوفة )

 كل كائن منفصل عن الاخر ولاكن انشئناهم على طريقة المصوفات واذا تريد التعامل مع كائن معين من خلال العدد في القوسين هذه [ ] مثل المصفوفات
*/

/*
في المثال التالي:
انشئنا كلاس اسمه Student
يوجد فيه خاصيتين وهما
name | ID

وانشئنا دالتين الاولى ترجع قيمة الاسم والثانية ترجع قيمة الايدي
*/
#include <iostream>
using namespace std;

// هنا انشئنا الكلاس
class Student
{
public: // هنا عرفنا الخصائص
    string name;
    int ID;
    // هنا عرفنا الدوال
    string get_name()
    {
        return name;
    }

    int get_id()
    {
        return ID;
    }
};



int main()
{
    // هنا انشئنا ثلاث كائنات بنفس الاسم 
    Student C1[3];
    
    // هنا اعطينا اسماء للكائنات 
    C1[0].name = "GK";
    C1[1].name = "Ali";
    C1[2].name = "Mohammed";

    // هنا اعطينا قيم للكائنات 
    C1[0].ID = 101;
    C1[1].ID = 102;
    C1[2].ID = 103;
    
    
    // هنا اردنا ان نطبع كل كائن وخصائصه من خلال حلقة تكرار مثلما كنا نفعل مع المصفوفات هل تتذكر ذلك
    for(int i=0; i < 3; i++)
    {
        cout << i << "-" << C1[i].get_name() << "\nID = " << C1[i].get_id() << "\n\n" ;
    }

    return 0;
}