/* 
تعريف دالة تأخذ باراميتر نوعه مؤشر لكائن من كلاس:

للوصول للأشياء الموجودة في مؤشر لكائن من كلاس نستخدم العامل -> و ليس العامل . المعتاد
*/


/*
في المثال التالي, قمنا بتعريف كلاس إسمه Car
يوجد فيه معلومات التي تتضمنها السيارة 
بعدها قمنا بتعريف دالة إسمها gprint
تأخذ بارميتر نوعه مؤشر لكائن pointer
عند استدعاءها نمرر لها عنوان كائن من Car
موجود في الذاكرة فتقوم بطباعة البيانات للسيارة
*/
#include <iostream>
using namespace std;


class Car 
{
public:
    string color;
    string name;
    int model;
};


    // هنا انشئنا الدالة لتقوم بطابعة معلومات السيارة
    void gprint(Car* C)
    {
        cout << "Name: " << C->name << "\n";
        cout << "Color: " << C->color << "\n";
        cout << "Model: " << C->model << "\n";
    }



int main()
{
    //هنا انشئنا الكائن
    Car C1;

    // هنا قمنا بإعطاء قيم لمتغيرات   
    C1.name = "Ford";
    C1.color = "Black";
    C1.model = 2022;
    
    // هنا استدعينا الدالة ومررنا عنوان الكائن حتى يؤشر عليه البوينتر من نوع Car 
    gprint(&C1);

    return 0;
}