/*
تعريف دالة تأخذ كائن من كلاس كباراميتر:

في المثال التالي, قمنا بتعريف كلاس إسمه car
يمثل المعلومات التي يمكن أن تملكها أي سيارة بعدها قمنا بتعريف دالة إسمها gprint()
عند استدعاءها نمرر لها كائن نوعه car 
فتقوم بطباعة معلومات السيارة
*/
#include <iostream>
using namespace std;


//  هنا عرفنا الكلاس Car
class Car 
{
public:
    string Color;
    int model;
};


    // هنا انشئنا دالة تاخذ بارميتر نوعه car 
    // وعند استدعائها يتم طباعة لون السيارة والموديل
    // وايضا الدالة لا تعتبر عضو في الكلاس
    void printInfo(Car CAR)
    {
        cout << "Color: " << CAR.Color << "\n";
        cout << "Model: " << CAR.model << "\n";
    }




int main()
{
    // هنا عرفنا الكائن    
    Car C1;

    //  هنا قمنا بإعطاء قيم للكائن     
    C1.Color = "Black";
    C1.model = 2022;
    
    // هنا استدعينا الدالة لكي تطبع المعلومات
    printInfo(C1);

    return 0;
}