/*
يمكنك تعريف دوال الكلاس بطريقتين:

1-تعريف الدالة كما هي بداخل الكلاس

2-تعريف شكل الدالة فقط بداخل الكلاس و تعريف محتوى الدالة خارج تعريف الكلاس.
*/



/*
في المثال التالي, قمنا بتعريف كلاس إسمه student 
يمثل المعلومات التي يمكن أن يتضمنها معلومات الطالب.
وعرفنا دالتين في الكلاس 

1.
gprint() الدالة 
كتابة الدالة كاملة بداخل الكلاس

2.
الدالة get_name_gpa()
تم كتابة رأس الدالة بداخل الكلاس وبعدها كتبنا محتوى الدالة خارج الكلاس
*/
#include <iostream>
using namespace std;

// هنا قمنا بتعريف الكلاس
class student 
{
public:
    // هنا عرفنا خواص الكلاس
    string name;
    double GPA;

    // هنا عرفنا الدالة كاملة بداخل الكلاس
    void gprint()
    {
        cout << "Name: " << name << "\n";
        cout << "GPA: " << GPA << "\n\n";
    }

    // هنا عرفنا رأس الدالة وسوف نكتب محتواها خارج الكلاس
    void get_name_gpa();
};

// هنا كتبنا محتوى الدالة 
void student::get_name_gpa()
{
    cout << "1-Name: " << name << "\n";
    cout << "2-GPA: " << GPA << "\n\n";
}



int main()
{
    // هنا عرفنا كائن من الكلاس student
    student C1;

    // هنا قمنا بأعطاء قيم للكائن
    C1.name = "GK";
    C1.GPA = 4.06;

    // هنا قمنا بأستدعاء الدوال   
    C1.gprint();
    C1.get_name_gpa();

    return 0;
}