/*
New - Delete

New:
ينشئ مؤشر بالاسم الذي تكتبه وبعدها يحجز مساحة في الذاكرة على حسب حجم المتغير الذي عرفته والمتغير لا تستطيع ان تصل اليه الى من خلال المؤشر الذي يؤشر عليه وبعد الانتهاء منه يجب ان تحذفه
---
Delete:
هو راح يحذف المتغير الذي يؤشر عليه المؤشر (راح يحذف المتغير وليس المؤشر)
*/
#include <iostream>
using namespace std;


int main()
{
    // هنا انشئنا مؤشر وبعدها انشئ متغير لكي يؤشر عليه المؤشر
    int *ptr = new int; 

    // اعطاء قيمة للمتغير عن طريق المؤشر
    *ptr = 50; 
    
    //طباعة قيمة المتغير عن طريق المؤشر
    cout << endl << "1-value: " << *ptr << endl; 

    // وهنا عندما انتهينا منه حذفنا المتغير (المتغير وليس المؤشر) 
    delete ptr; 
    //  طباعة عنوان المؤشر
    cout << "1-Memory location: " << ptr << "\n\n"; 


    // تهيئة متغير للمؤشر مرة اخرى
    ptr = new int; 

    // اعطاء قيمة للمتغير عن طريق المؤشر
    *ptr = 20;
    
    //طباعة قيمة المتغير عن طريق المؤشر
    cout << endl << "2-value : " << *ptr << endl; 
    delete ptr; 
    cout << "2-Memory location : " << ptr << endl;


return 0;
}
