/*
Static Class Members:
عبارة عن أي شيء يتم تعريفه في الكلاس بشكل يكون موحدا بالنسبة لجميع الكائنات التي يتم إنشاءها منه
بشكل عام لجعل الشيئ الذي يتم تعريفه في الكلاس مشترك بين جميع الكائنات التي قد ننشئها منه نستخدم الكلمة static
*/


/*
في المثال التالي, قمنا بتعريف كلاس إسمه Test
عرفنا فيه متغير عادي اسمه x
و متغير مشترك إسمه y

المتغير المشترك y
قمنا بإعطائه 0 كقيمة أولية خارج الكلاس

بعدها قمنا بإنشاء كائنين من الكلاس Test
و إعطاء قيمة مختلفة للمتغير x
الخاص بكل الكائن

في النهاية قمنا بتغيير قيمة المتغير المشترك y
وسوف تلاحظ ان القيمة تغيرت لجميع الكائنات التي انشئناها
*/
#include <iostream>
using namespace std;


class Test
{
public:
    int x;          // متغير عادي
    static int y;   // متغير مشترك ويجب ان تضغ الكلمة static
};

// هنا اعطينا المتغير المشترك قيمة بدائية من خارج الكلاس
int Test::y = 0;



int main()
{
    // هنا انشئنا ثلاث كائنات
    Test T1, T2, T3;


    // هنا غيرنا قيمة المتغير x 
    // في كل كائن انشئناه لانه متغير عادي وليس مشترك قيمته ليست مشتركة بين جميع الكائنات
    T1.x = 500;
    T2.x = 1500;
    T3.x = 2000;


    // طبعنا قيمة المتغير x 
    // في كل كائن انشئناه
    cout << "\nValue X:";    
    cout << "\nT1 x: " << T1.x;
    cout << "\nT2 x: " << T2.x;
    cout << "\nT3 x: " << T3.x << "\n";



    //طبعنا قيمة المتغير y
    // قبل ان نغير قيمته وهو متغير مشترك
    cout << "\nValue Y Befor:";    
    cout << "\nT1 y: " << T1.y;
    cout << "\nT2 y: " << T2.y;
    cout << "\nT3 y: " << T3.y << "\n";


    // هنا غيرنا قيمة المتغير المشترك ,لو غيرت القيمة من خلال اي كائن انشئته او بدون كائن مثل ما فعلنا هنا سوف تتغير عند الكل لانها مشتركة للجميع
    T3.y = 353;


    // هنا قمنا بطباعة المتغير المشترك من خلال جميع الكائنات الموجودة وسوف تلاحظ انها تغير القيمة لان المتغير مشترك وليس خاص ب كائن معين
    cout << "\nValue Y After:";    
    cout << "\nT1 y: " << T1.y;
    cout << "\nT2 y: " << T2.y;
    cout << "\nT3 y: " << T3.y << "\n";

return 0;
}