// طريقة تعريف دالة تأخذ باراميتر من النوع enum:



/*
في المثال التالي قمنا بتعريف  enum
إسمه Logic
يمثل 0 اذا كان false
و 1 اذا كان true

بعدها قمنا بتعريف دالة إسمها gprint()
عند استدعاءها نمرر لها كائن من النوع Logic
فتقوم بالتشييك على قيمته و على أساسه تقوم بطباعة نص معين
*/
#include <iostream>
using namespace std;

// Logic إسمه enum هنا قمنا بتعريف
enum Logic
{
    FALSE,
    TRUE 
};


// Logic عند استدعاءها يجب أن نمرر لها قيمة عبارة عن كائن من gprint هنا قمنا بتعريف دالة 
void gprint(Logic LOGIC)
{
    /**
     *  اذا كانت القيمة تساوي false
     *   سيتم تنفيذ هذا الامر
     */
    if (LOGIC == FALSE)
        cout << "False" << endl;

    // اذا كانت القيمة لا تساوي الشرط سوف يتم تنفيذ هذا الامر
    else
        cout << "True" << endl;
}


int main()
{
    /*
     * هنا انشئنا كائن من Logic
     * واعطيناه قيمة
     */
    Logic LOGIC = FALSE;

    // هنا استدعينا الدالة وسوف تشيك على قيمة الكائن وسوف تطبق الامر الذي يتحقق مع الشرط المنطقي الذي وضعناه في الدالة
    gprint(LOGIC);

return 0;
}