/*
في المثال التالي:
انشئنا كلاس اسمه Abstraction
وعرفنا فيه خصائص خاصة اسمهما 
x و y
بعدها انشئنا دالة لكي تعطي قيم للخصائص الخاصة ,وبعدها انشئنا دالة لكي تطبع قيم هذه الخصائص الخاصة
*/
#include <iostream>
using namespace std;


// هنا انشئنا الكلاس
class Abstraction 
{
private :
    // Private هنا جعلنا الخصائص خاصة 
    int x , y;
public :
    // هنا عرفنا دالة لكي تعطي قيم للخصائص التي عرفناها انها خاصة
    void set ( int XX , int YY )
    {
        x = XX ;
        y = YY ;
    }

    // هنا عرفنا دالة لكي تعرف قيم الخصائص الخاصة
    void gPrint () 
    {
        cout << "x  = " << x  << endl ;
        cout << "y  = " << y << "\n\n" ;
    }
};


int main ()
{
    // هنا انشئنا كائن من الكلاس
    Abstraction C1;
    
    // هنا اعطيناه قيم من خلال الدالة
    C1.set ( 110 , 250 );
    
    // هنا طبعنا قيم الكائن من خلال الدالة
    C1.gPrint ();

return 0;
}