/*
الكلمة this
هو بوينتر يؤشر على الكائن الذي استدعاه 
(يعني الكائن الذي يستدعي دالة توجد فيه this )
*/

/*
في المثال التالي:
انشئنا كلاس اسمه Base
يملك دالة تطبع عنوان الكائن في الذاكرة من خلال الكلمة this

وبعدها انشئنا ثلاث كائنات من هذا الكلاس وطبعنا عنواينهم
*/
#include <iostream>
using namespace std;


// هنا انشئنا الكلاس Base
class Base
{
public:
    // هنا انشئنا الدالة التي سوف ترجع عنوان الكائن الذي يستدعيها
    void Address()
    {
        cout << this << endl;
    }
};
 

int main()
{
    // هنا انشئنا ثلاث كائنات من الكلاس
    Base C1 ,C2, C3;

    // هنا طبعنا نص بعدها استدعينا الدالة لكي تطبع عنوان الكائن في الذاكرة
    cout << "Address of C1 = ";
    C1.Address();

    // هنا طبعنا نص بعدها استدعينا الدالة لكي تطبع عنوان الكائن في الذاكرة
    cout << "Address of C2 = ";
    C2.Address();

    // هنا طبعنا نص بعدها استدعينا الدالة لكي تطبع عنوان الكائن في الذاكرة
    cout << "Address of C3 = ";
    C3.Address();

    return 0;
}