/*
التفرقة بين باراميترات الدوال و متغير الخاص بالكلاس:

الكلمة this->
وهو يستخدم للتفرقة بين باراميترات الدوال و المتغيرات التي يمتلكها الكلاس الموجودة في الكلاس المتغيرات والمصفوفات وغيرها
وهو يجعلك ان تضع اسم البارميتر التي تأخذه الدالة نفس اسم الخاصية الموجود في الكلاس بدون اخطاء

لحل المشكلة المنطقة التي تكون تشابه اسم المتغير والبارميتر للدالة سنستخدم الكلمة 
this->
*/



/*
في المثال التالي, قمنا بتعريف كلاس إسمه Car
بداخل الكلاس وضعنا متغير واحد فقط لكي تفهم الفائدة من الكلمة this->
عرفنا بداخل الكلاس متغير اسمه color
وبعدها قمنا بتعريف دالة إسمها SetModel()
عند استدعاءها نعطي قيمة لموديل السيارة
وجعلنا اسم البارميتر للدالة نفس اسم المتغير في الكلاس ولم تحدث مشكلة
*/
#include <iostream>
using namespace std;
class Car 
{
public:
    // هنا عرفنا المتغير خاص بالكلاس
    string color;
    
    /*
     * هنا الدالة تأخذ بارميتر اسمه color 
     * وتضعه في متغير في الكلاس اسمه ايضا color 
     * بدون مشاكل لاننا استخدمنا العامل this-> 
     * المترجم فرق بين المتغير الذي في الكلاس والذي تأخذه الدالة ك بارميتر لاننا استخدمنا الكلمة 
     * this->
     */
    void SetModel(string color)
    {
        this->color = color;
    }
};



int main()
{
    //هنا قمنا بتعريف كائن 
    Car C1;
    
    // هنا استدعينا الدالة واعطيناها قيمة للون السيارة
    C1.SetModel("White");
    
    // هنا طبعنا لون السيارة للتأكد
    cout << "Color : " << C1.color << endl;

return 0;
}

