/*
اعطاء باراميتر يملك نفس الاسم لمتغير :
اذا اردت ان تجعل بارميتر لدالة يكون نفس اسم متغير في الكلاس هنا سوف تكون مشكلة لان لا يعرف المترجم ماذا تقصد  
لان يوجد متغيرين نفس الاسم ولن يعرف ماذا تقصد هل الاول او الثاني
ولحل هذه المشكلة تستطيع ان تستخدم الكلمة this
لكي يفرق بين الباراميتر والمتغير في الكلاس
*/

/*
في المثال التالي:
عرفنا كلاس اسمه Base
يملك متغير اسمه Data

بعدها عرفنا دالة بداخله تأخذ باراميتر ايضا اسمه Data
وجعلنا المترجم يفرق بين الباراميتر والمتغير نفسه في الكلاس
من خلال استخدام الكلمة 
this->
*/
#include <iostream>
using namespace std;


// هنا عرفنا الكلاس
class Base
{
public:
    int Data;
    // هنا عرفنا الدالة التي سوف تأخذ باراميتر نفس اسم المتغير لكي نعطيه قيمة
    void set_Data(int Data)
    {
        // هنا طريقة كتابة الكلمة this
        // لكي تعطي قيمة للمتغير Data
        this->Data = Data;
    }
};


int main()
{
    // هنا انشئنا كائن من الكلاس
    Base C1;

    //هنا استدعينا الدالة لكي تعطي قيمة للمتغير Data
    C1.set_Data(17);
    
    //هنا طبعنا قيمة المتغير لكي نتأكد انه تم اعطائه القيمة
    cout << "Data = " << C1.Data << "\n";

    return 0;
}