/*
الكلمة #define:

وهي بكل بساطة يمكنك أن تستخدمها لتعريف متغير قيمته ثابتة مثل الكلمة const
و لكن بأسلوب مختلف

في المثال التالي قمنا بتعريف متغير ثابت إسمه Pi
قيمته تساوي 3.14 وبعدها انشئنا متغير واعيناه قيمة 
Pi ال
*/


#include <iostream>
using namespace std;

// هنا عرفنا المتغير بشكل ثابت واعطيناه قيمة
#define Pi 3.14 

int main()
{
    // pi هنا عرفنا متغير جديد واعطيناه قيمة ال
    double X = Pi;
    
    // هنا قمنا بطباعة قيمة المتغيرين
    cout << "Pi = " << Pi << endl;
    cout << "X  = " << X << endl;
    
    return 0;
}
/*
الكلمة #define
قد تسبب مشاكل في البرنامج لأن نوع القيمة التي يتم وضعها فيها ليس محددا
لذلك الافضل تعريف المتغير الثابت دائماً بواسطة الكلمة const
*/