/*
تعريف العامل ++:

في المثال التالي:
قمنا بأنشاء كلاس اسمه count
وانشئنا فيه اوبريتير يقوم بزيادة جميع الخصائص بمقدار واحد
وبعدها انشئنا دالة لكي تطبع القيم للكائن
*/
#include <iostream>
using namespace std;

// هنا انشئنا الكلاس
class Count
{
private:
    int x = 0;
    int y = 0;
public:

    // هنا انشئنا الابريتير الذي سوف يزيد من قيم الخصائص بمقدار واحد
    void operator++()
    {
        ++x;
        ++y;
    }

    // دالة لطباعة القيم
    void print()
    {
        cout << "X = " << x << endl;
        cout << "Y = " << x << "\n\n";
    }
};




int main()
{
    // انشئنا كائن من الكلاس
    Count C1;

    // طبعنا قيمته قبل ان نزيد من قيمته
    C1.print();
    
    // هنا زدنا من قيمة الكائن بالطريقة التي كأننا نزيد قيمة اي متغير اخر
    ++C1;

    // طبعنا قيمته بعد ان زدنا من قيمته
    C1.print();
    
    
    return 0;
}